app/views/ads/index.html.haml

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  %p{style: "text-align:left;"}
   - if User.find(ad.user_id).avatar.attached?