app/views/ads/show.html.haml

    %p{style: "text-align:right;"}
        - pre_favorite = @ad.favorites.find { |favorite| favorite.user_id == current_user.id}
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."ad_id" = ?  [["ad_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]