app/views/comments/new.html.haml

  = label :comment, :user, 'User'
  = collection_select(:user,:mate_id,Mate.all,:id,:name)
---
SELECT "mates".* FROM "mates"
SELECT "users".* FROM "users"