app/views/articles/index.html.haml

    %td=link_to "Dettagli", article_path(article)
    %td= article.likes.count
    %td= (article.likes.count) == 1 ? 'Like' : 'Likes'
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."article_id" = ?  [["article_id", 1]]