app/views/articles/show.html.haml


    - pre_like = @article.likes.find { |like| like.user_id == current_user.id}
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."article_id" = ?  [["article_id", 2]]

        = button_to 'Like', article_likes_path(@article), method: :post
    = @article.likes.count
    = (@article.likes.count) == 1 ? 'Like' : 'Likes'
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."article_id" = ?  [["article_id", 2]]


- if @article.comments.empty?
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 1]]
SELECT 1 AS one FROM "comments" WHERE "comments"."article_id" = ? LIMIT ?  [["article_id", 2], ["LIMIT", 1]]

    %p
        - @article.comments.each do |r|
            %b= User.find(r.user_id).name
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 2]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]