app/views/users/show.html.haml

SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ?  [["user_id", 5]]
SELECT 1 AS one FROM "likes" WHERE "likes"."user_id" = ? LIMIT ?  [["user_id", 5], ["LIMIT", 1]]
---
%h3 Articoli che piacciono a #{@user.name}:
- if @user.likes.empty?

SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ?  [["user_id", 5]]
---
    %br
    - @user.likes.each do |c|

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
            Titolo:
            = Article.find(c.article_id).title

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
            Release date:
            = Article.find(c.article_id)&.release_date&.strftime("%B %d %Y")

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
---
            Testo articolo:
            = Article.find(c.article_id).text

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."article_id" = ?  [["article_id", 22]]
---
            Autore articolo:
            = Article.find(c.article_id).author
        = Article.find(c.article_id).likes.count
        = (Article.find(c.article_id).likes.count) == 1 ? 'Like' : 'Likes'