app/views/users/show.html.haml

SELECT 1 AS one FROM "favorites" WHERE "favorites"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "favorite_ads".* FROM "favorite_ads" WHERE "favorite_ads"."user_id" = ?  [["user_id", 5]]
SELECT 1 AS one FROM "favorite_ads" WHERE "favorite_ads"."user_id" = ? LIMIT ?  [["user_id", 5], ["LIMIT", 1]]
---
%h3 Favorite Ads:
- if @user.favorite_ads.empty?