app/views/users/show.html.haml

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
                    - @user.favorites.each do |f|
                        - pre_favorite = Ad.find(f.ad_id).favorites.find { |favorite| favorite.user_id == current_user.id}