app/controllers/ads_controller.rb

    def destroy
        if current_user==Ad.find(params[:id]).user
---
SELECT "users".* FROM "users" INNER JOIN "favorite_ads" ON "users"."id" = "favorite_ads"."user_id" WHERE "favorite_ads"."ad_id" = ?  [["ad_id", 24]]

    def update
        if current_user==Ad.find(params[:id]).user
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]