app/controllers/articles_controller.rb

	def create
		p=params.require(:article).permit(:title, :release_date, :text, :author)
		Article.create(p)
---
INSERT INTO "articles" ("title", "release_date", "text", "author", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

	def index
		@all = Article.all
---
SELECT "articles".* FROM "articles"

	def show
		id = params[:id]
		if Article.exists?(id)
			@article = Article.find(id)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def update
		Article.find(params[:id]).update(params[:article].permit(:title, :release_date, :text, :author))
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "text" = ?, "author" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Bollette"], ["text", "Aumento dell'IVA del calcolo delle bollette"], ["author", "Nicola Marchi"], ["updated_at", "2022-01-02 15:36:20.345257"], ["id", 17]]

	def destroy
		Article.find(params[:id]).destroy
---
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 4]]
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

	def search
		if params[:search].blank?
			redirect_to articles_path and return
		else
			@parameter = params[:search].downcase
			@results = Article.all.where("lower(title) LIKE :search", search: "%#{@parameter}%")
---
SELECT "articles".* FROM "articles" WHERE (lower(title) LIKE '%prova%')