app/controllers/comments_controller.rb

  def update
    @comment=Article.find(params[:article_id]).comments.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comment_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "comments" ("article_id", "created_at", "updated_at", "user_id", "body") VALUES (?, ?, ?, ?, ?)  [["article_id", 4], ["created_at", "2021-12-18 18:10:57.702977"], ["updated_at", "2021-12-18 18:10:57.702977"], ["user_id", 1], ["body", "commento1"]]