app/controllers/favorites_controller.rb

  def create
        if already_favorited?
            flash[:notice] = "You can't like more than once"
        else
            @ad.favorites.create(user_id: current_user.id)
---
INSERT INTO "favorites" ("ad_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["ad_id", 1], ["user_id", 1], ["created_at", "2022-01-25 17:55:57.785304"], ["updated_at", "2022-01-25 17:55:57.785304"]]