app/controllers/likes_controller.rb

INSERT INTO "likes" ("article_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["article_id", 1], ["user_id", 5], ["created_at", "2022-01-11 15:49:46.962250"], ["updated_at", "2022-01-11 15:49:46.962250"]]
---
    def create
        if already_liked?
            flash[:notice] = "You can't like more than once"
        else
            @article.likes.create(user_id: current_user.id)

DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 2]]
---
    def destroy
        if !(already_liked?)
          flash[:notice] = "Cannot unlike"
        else
          @like.destroy

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def find_post
        @article = Article.find(params[:article_id])

SELECT 1 AS one FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."article_id" = ? LIMIT ?  [["user_id", 5], ["article_id", 1], ["LIMIT", 1]]
---
    def already_liked?
        Like.where(user_id: current_user.id, article_id:
        params[:article_id]).exists?

SELECT "likes".* FROM "likes" WHERE "likes"."article_id" = ? AND "likes"."id" = ? LIMIT ?  [["article_id", 1], ["id", 2], ["LIMIT", 1]]
---
    def find_like
        @like = @article.likes.find(params[:id])