app/controllers/mates_controller.rb

    def index
        @mates = Mate.all
---
SELECT "mates".* FROM "mates"