app/controllers/services_controller.rb

	def index
		@all = Service.all
---
SELECT "services".* FROM "services"