app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "encrypted_password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["encrypted_password", "$2a$12$HeP.ZFgAN6Qun7swbBYptOuGzVaJ1hcJkAVIV0XMoWJgpjfma4L6y"], ["updated_at", "2022-01-05 15:52:03.311343"], ["id", 4]]
---
   def update
      @user = User.find(params[:id])
      if @user.update(user_params)